// for cycle syntax

// for (начало; условие; шаг) {
//     // ... тело цикла ...
// }

// for cycle example

// for (let i = 0; i < 3; i++) { // выведет 0, затем 1, затем 2
//     alert(i);
// }

// часть
// начало	i = 0	    Выполняется один раз при входе в цикл
// условие	i < 3	    Проверяется перед каждой итерацией цикла. Если оно вычислится в false, цикл остановится.
// шаг	    i++	        Выполняется после тела цикла на каждой итерации перед проверкой условия.
// тело	    alert(i)	Выполняется снова и снова, пока условие вычисляется в true.



// Пропуск частей «for»

// let i = 0; // мы уже имеем объявленную i с присвоенным значением
//
// for (; i < 3; i++) { // нет необходимости в "начале"
//     alert( i ); // 0, 1, 2
// }

// console.log(i)


// Можно убрать и шаг:
// let i = 0;
//
// for (; i < 3;) {
//     alert( i++ );
// }

// Можно убрать все
let i = 0;
for (;;) {
    i++;

    if(i % 2 === 0) {
        console.log('Четное: ', i);
    } else {
        console.log('не четное: ', i);
    }

    if(i >= 10) {
        break;
    }

}